Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: Returns true if and only if the unit test failed (i.e. some test suite failed or something outside of all tests failed).
it_it: Restituisce true se e solo se la unit test è fallita (cioè qualche test suite ha fallito o qualcosa al di fuori di tutti i test è fallito).

source: Returns true if and only if the unit test passed (i.e. all test suites passed).
it_it: Restituisce true se e solo se la unit test è stata superata (ovvero tutte le test suite sono state superate).

source: Returns true if and only if this test will appear in the XML report.
it_it: Restituisce true se e solo se questo test apparirà nel report XML.

source: Returns true if any test in this test suite should run.
it_it: Restituisce true se qualsiasi test in questa test suite dev'essere eseguito.

source: Returns true if this test should not be run because it's in another shard.
it_it: Restituisce true se questo test non deve essere eseguito perché si trova in un altra macchina di test [shard].

source: Returns true if this test should run, that is if the test is not disabled (or it is disabled but the also_run_disabled_tests flag has been specified) and its full name matches the user-specified filter.
it_it: Restituisce true se questo test deve essere eseguito, cioè se il test non è disabilitato (o è disabilitato ma è stato specificato il flag also_run_disabled_tests) e il suo nome completo corrisponde [match] al filtro specificato dall'utente.

source: Returns true if this test should run, that is if the test is not disabled (or it is disabled but the `also_run_disabled_tests` flag has been specified) and its full name matches the user-specified filter.
it_it: Restituisce true se questo test deve essere eseguito, cioè se il test non è disabilitato (o è disabilitato ma è stato specificato il flag `also_run_disabled_tests`) e il suo nome completo corrisponde [match] al filtro specificato dall'utente.

source: Run the same test program on all shards.
it_it: Eseguire lo stesso programma di test su tutti gli shard.

source: Running SquareRootTest with gtest_output, gtest_repeat, and gtest_filter
it_it: Esecuzione di SquareRootTest con gtest_output, gtest_repeat e gtest_filter

source: Running Test Programs: Advanced Options
it_it: Esecuzione dei Programmi di Test: Opzioni Avanzate

source: Running Tests in Emacs
it_it: Esecuzione di Test in Emacs

source: Running a Subset of the Tests
it_it: Eseguire un Sottoinsieme dei Test

source: Running a death test using Google's framework
it_it: Esecuzione di un death test col framework di Google

source: Running the first test
it_it: Esecuzione del primo test

source: Running the square root test
it_it: Esecuzione del test della radice quadrata

source: Running the tests is simple.
it_it: Eseguire i test è semplice.

source: Runs the test on the fixture object.
it_it: Esegue il test sull'oggetto fixture.

source: Same as SetArgPointee<N>(value).
it_it: Uguale a SetArgPointee<N>(value).

source: Same as `SetArgPointee<N>(value)`.
it_it: Uguale a `SetArgPointee<N>(value)`.

source: Sample #1 shows the basic steps of using googletest to test C++ functions.
it_it: Sample #1 mostra i passaggi fondamentali per utilizzare googletest per testare le funzioni C++.

source: Sample #10 shows use of the listener API to implement a primitive memory leak checker.
it_it: Sample #10 mostra l'uso dell'API del listener per implementare un controllo primitivo per i memory leak.

source: Sample #2 shows a more complex unit test for a class with multiple member functions.
it_it: Sample #2 mostra una unit test più complessa per una classe con più funzioni membro.

source: Sample #3 uses a test fixture.
it_it: Sample #3 usa una fixture.

source: Sample #4 teaches you how to use googletest and googletest.h together to get the best of both libraries.
it_it: Sample #4 insegna come utilizzare googletest e googletest.h insieme per ottenere il meglio da entrambe le librerie.

source: Sample #4 teaches you how to use googletest and `googletest.h` together to get the best of both libraries.
it_it: Sample #4 insegna come utilizzare googletest e `googletest.h` insieme per ottenere il meglio da entrambe le librerie.

source: Sample #5 puts shared testing logic in a base test fixture, and reuses it in derived fixtures.
it_it: Sample #5 inserisce la logica di test condivisi in una fixture di base e la riutilizza in fixture derivate.

source: Sample #6 demonstrates type-parameterized tests.
it_it: Sample #6 illustra i test con tipi parametrizzati.

source: Sample #7 teaches the basics of value-parameterized tests.
it_it: Sample #7 insegna le basi dei test valori parametrizzati.

source: Sample #8 shows using Combine() in value-parameterized tests.
it_it: Sample #8 mostra l'utilizzo di Combine() in test con valori parametrizzati.

source: Sample #8 shows using `Combine()` in value-parameterized tests.
it_it: Sample #8 mostra l'utilizzo di `Combine()` in test con valori parametrizzati.

source: Sample #9 shows use of the listener API to modify Google Test's console output and the use of its reflection API to inspect test results.
it_it: Sample #9 mostra l'utilizzo dell'API listener per modificare l'output della console di Google Test e l'utilizzo della relativa API di [reflection] (riflessione) per esaminare i risultati del test.

source: Sample use of a fixture
it_it: Esempio di utilizzo di una fixture

source: Sanitizer Integration
it_it: Integrazione del Sanitizer

source: Save the N-th (0-based) argument to *pointer.
it_it: Salva l'argomento N-esimo (in base 0) in *pointer.

source: Save the `N`-th (0-based) argument to `*pointer`.
it_it: Salva l'argomento `N`-esimo (in base 0) in `*pointer`.

source: Save the value pointed to by the N-th (0-based) argument to *pointer.
it_it: Salva il valore puntato dall'argomento N-esimo (in base 0) in *pointer.

source: Save the value pointed to by the `N`-th (0-based) argument to `*pointer`.
it_it: Salva il valore puntato dall'argomento `N`-esimo (in base 0) in `*pointer`.

source: Saves the state of all GoogleTest flags.
it_it: Salva lo stato di tutti i flag di GoogleTest.

source: Say you installed GoogleTest to /usr/local, then it might be that the .pc files are installed under /usr/local/lib64/pkgconfig.
it_it: Supponiamo che GoogleTest sia installato su /usr/local, è possibile che i file .pc siano installati in /usr/local/lib64/pkgconfig.

source: Say you have a mock function Foo() that takes seven arguments, and you have a custom action that you want to invoke when Foo() is called.
it_it: Supponiamo che si abbia una funzione mock Foo() che accetta sette argomenti e che si abbia un'azione personalizzata che da invocare quando viene chiamata Foo().

source: Say you have a mock function `Foo()` that takes seven arguments, and you have a custom action that you want to invoke when `Foo()` is called.
it_it: Supponiamo che si abbia una funzione mock `Foo()` che accetta sette argomenti e che si abbia un'azione personalizzata che da invocare quando viene chiamata `Foo()`.

source: Say you installed GoogleTest to `/usr/local`, then it might be that the `.pc` files are installed under `/usr/local/lib64/pkgconfig`.
it_it: Supponiamo che GoogleTest sia installato su `/usr/local`, è possibile che i file `.pc` siano installati in `/usr/local/lib64/pkgconfig`.

source: Second, if a mock function doesn't have a default action, or the default action doesn't suit you, you can specify the action to be taken each time the expectation matches using a series of WillOnce() clauses followed by an optional WillRepeatedly().
it_it: In secondo luogo, se una funzione mock non ha un'azione di default, o questa non è adatta alle proprie esigenze, si può specificare l'azione da intraprendere ogni volta che la expectation corrisponde utilizzando una serie di clausole WillOnce() seguite da un facoltativo WillRepeatedly().

source: Second, if a mock function doesn't have a default action, or the default action doesn't suit you, you can specify the action to be taken each time the expectation matches using a series of `WillOnce()` clauses followed by an optional `WillRepeatedly()`.
it_it: In secondo luogo, se una funzione mock non ha un'azione di default, o questa non è adatta alle proprie esigenze, si può specificare l'azione da intraprendere ogni volta che la expectation corrisponde utilizzando una serie di clausole `WillOnce()` seguite da un facoltativo `WillRepeatedly()`.

source: See AssertionResult.
it_it: Vedere AssertionResult.

source: See Death Assertions in the Assertions Reference for details.
it_it: Per i dettagli, vedere Asserzioni Death nei Riferimenti sulle Asserzioni.

source: See Global Set-Up and Tear-Down.
it_it: Consultare Set-Up e Tear-Down Globali.

source: See Registering tests programmatically for more information.
it_it: Vedere Registrazione dei test programmaticamente per ulteriori informazioni.

source: See Running a Subset of the Tests for more information.
it_it: Per ulteriori informazioni, consultare Eseguire un Sottoinsieme dei Test.

source: See Teaching GoogleTest How to Print Your Values for more information.
it_it: Vedere Insegnare a GoogleTest Come Stampare i Propri Valori per ulteriori informazioni.

source: See this section for more details.
it_it: Consultare questa sezione per ulteriori dettagli.

source: See Assertion Placement for more information.
it_it: Vedere Posizionamento delle Asserzioni per ulteriori informazioni.

source: See Multi-argument Matchers for the complete list.
it_it: Consultare Matcher Multi-argomento per la lista completa.

source: See Value-Parameterized Tests.
it_it: Vedere Test con Valori Parametrizzati.

source: See this table for a list of currently supported versions compilers, platforms, and build tools.
it_it: Consultare questa tabella per un elenco delle versioni di compilatori, di piattaforme e di strumenti di building attualmente supportati.

source: See Global Set-Up and Tear-Down for more information.
it_it: Vedere Set-Up e Tear-Down Globali per ulteriori informazioni.

source: See EXPECT_PRED* in the Assertions Reference for details.
it_it: Vedere EXPECT_PRED* nei "Riferimenti sulle Asserzioni" per i dettagli.

source: See Tip of the Week #49 for details.
it_it: Per i dettagli vedere Tip of the Week #49.

source: See Understanding Uninteresting vs Unexpected Calls.
it_it: Vedere Le Chiamate Poco Interessanti e Quelle Unexpected.

source: See Knowing When to Expect for a more detailed discussion.
it_it: Vedere Quando usare Expect per una discussione più dettagliata.

source: See Specifying Names for Value-Parameterized Test Parameters for more information.
it_it: Consultare Specificare i Nomi per i Parametri di test con Valori Parametrizzati per ulteriori informazioni.

source: See EXPECT_PRED_FORMAT* in the Assertions Reference for details.
it_it: Per i dettagli, vedere EXPECT_PRED_FORMAT* nei "Riferimenti sulle Asserzioni".

source: See EXPECT_CALL in the Mocking Reference.
it_it: Vedere EXPECT_CALL nella "Guida al Mocking".

source: See EXPECT_THAT in the Assertions Reference.
it_it: Vedere EXPECT_THAT nei "Riferimenti sulle Asserzioni".

source: See TestEventListeners.
it_it: Vedere TestEventListeners.

source: See TestResult.
it_it: Vedere TestResult.

source: See Death Assertions in the Assertions Reference.
it_it: Vedere Asserzioni Death nei Riferimenti sulle Asserzioni.

source: See Exception Assertions in the Assertions Reference.
it_it: Vedere Exception Assertions nelle "Asserzioni di Eccezioni".

source: See Explicit Success and Failure in the Assertions Reference.
it_it: Vedere Explicit Success and Failure nei "Riferimenti sulle Asserzioni".

source: See Floating-Point Comparison in the Assertions Reference.
it_it: Vedere Floating-Point Comparison nei "Riferimenti sulle Asserzioni".

source: See Skipping Test Execution for more information.
it_it: Vedere Skipping Test Execution per ulteriori informazioni.

source: See Supported Platforms for more information about platforms compatible with GoogleTest.
it_it: Vedere Supported Platforms per ulteriori informazioni sulle piattaforme compatibili con GoogleTest.

source: See Testing Private Code for more information.
it_it: Vedere Testing Private Code per ulteriori informazioni.

source: See Type Assertions for more information.
it_it: Consultare Type Assertions per ulteriori informazioni.

source: See Typed Tests and Type-Parameterized Tests for more information.
it_it: Vedere Test Tipizzati e Test con i Tipi Parametrizzati per ulteriori informazioni.

source: See Using Mocks in Tests for more information.
it_it: Vedere Uso dei Mock nei Test per ulteriori informazioni.

source: See Windows HRESULT Assertions in the Assertions Reference.
it_it: Vedere Windows HRESULT Assertions nei "Riferimenti sulle Asserzioni".

source: See sample10_unittest.cc for an example of a failure-raising listener.
it_it: Vedere sample10_unittest.cc per un esempio di un listener che genera errori.

source: See Multi-argument Matchers.
it_it: Consultare Matcher Multi-argomento.

source: See Typed Tests and Type-Parameterized Tests.
it_it: Vedere Test Tipizzati e Test con i Tipi Parametrizzati.

source: See TYPED_TEST for an example.
it_it: Vedere TYPED_TEST per un esempio.

source: See TYPED_TEST_SUITE for an example.
it_it: Vedere TYPED_TEST_SUITE per un esempio.

source: See Times.
it_it: Vedere Times.

source: See Supported Platforms for more details on supported language versions.
it_it: Vedere Supported Platforms per ulteriori dettagli sulle versioni dei linguaggi supportate.

source: See gmock-actions.h for examples.
it_it: Per gli esempi consultare gmock-actions.h.

source: See MSDN for more details and additional heap check/debug routines.
it_it: Consultare MSDN per ulteriori dettagli e routine aggiuntive di check/debug.

source: See [Assertion Placement](../advanced.md#assertion-placement) for more information.
it_it: Vedere [Posizionamento delle Asserzioni](../advanced.md#assertion-placement) per ulteriori informazioni.

source: See [Death Assertions](reference/assertions.md#death) in the Assertions Reference for details.
it_it: Vedere [Death Assertions](reference/assertions.md#death) nei "Riferimenti sulle Asserzioni" per i dettagli.

source: See [Death Assertions](reference/assertions.md#death) in the Assertions Reference.
it_it: Vedere [Death Assertions](reference/assertions.md#death) nei "Riferimenti sulle Asserzioni".

source: See [Exception Assertions](reference/assertions.md#exceptions) in the Assertions Reference.
it_it: Vedere [Exception Assertions](reference/assertions.md#exceptions) nelle "Asserzioni di Eccezioni".

source: See [Explicit Success and Failure](reference/assertions.md#success-failure) in the Assertions Reference.
it_it: Vedere [Explicit Success and Failure](reference/assertions.md#success-failure) nei "Riferimenti sulle Asserzioni".

source: See [Floating-Point Comparison](reference/assertions.md#floating-point) in the Assertions Reference.
it_it: Vedere [Floating-Point Comparison](reference/assertions.md#floating-point) nei "Riferimenti sulle Asserzioni".

source: See [Global Set-Up and Tear-Down](../advanced.md#global-set-up-and-tear-down) for more information.
it_it: Vedere [Global Set-Up and Tear-Down](../advanced.md#global-set-up-and-tear-down) per ulteriori informazioni.

source: See [Global Set-Up and Tear-Down](../advanced.md#global-set-up-and-tear-down).
it_it: Consultare [Global Set-Up e Tear-Down](../advanced.md#global-set-up-and-tear-down).

source: See [Knowing When to Expect](gmock_cook_book.md#UseOnCall) for a more detailed discussion.
it_it: Vedere [Quando usare Expect](gmock_cook_book.md#UseOnCall) per una discussione più dettagliata.

source: See [Multi-argument Matchers](matchers.md#MultiArgMatchers).
it_it: Consultare [Matcher Multi-argomento](matchers.md#MultiArgMatchers).

source: See [Multi-argument Matchers](reference/matchers.md#MultiArgMatchers) for the complete list.
it_it: Consultare [Multi-argument Matchers](reference/matchers.md#MultiArgMatchers) per la lista completa.

source: See [Registering tests programmatically](../advanced.md#registering-tests-programmatically) for more information.
it_it: Vedere [Registering tests programmatically](../advanced.md#registering-tests-programmatically) per ulteriori informazioni.

source: See [Running a Subset of the Tests](../advanced.md#running-a-subset-of-the-tests) for more information.
it_it: Vedere [Eseguire un Sottoinsieme dei Test](../advanced.md#running-a-subset-of-the-tests) per ulteriori informazioni.

source: See [Skipping Test Execution](../advanced.md#skipping-test-execution) for more information.
it_it: Vedere [Skipping Test Execution](../advanced.md#skipping-test-execution) per ulteriori informazioni.

source: See [Specifying Names for Value-Parameterized Test Parameters](../advanced.md#specifying-names-for-value-parameterized-test-parameters) for more information.
it_it: Consultare [Specificare i Nomi per i Parametri di test con Valori Parametrizzati](../advanced.md#specifying-names-for-value-parameterized-test-parameters) per ulteriori informazioni.

source: See [Supported Platforms](platforms.md) for more details on supported language versions.
it_it: Vedere [Supported Platforms](platforms.md) per ulteriori dettagli sulle versioni dei linguaggi supportate.

source: See [Supported Platforms](platforms.md) for more information about platforms compatible with GoogleTest.
it_it: Vedere [Supported Platforms](platforms.md) per ulteriori informazioni sulle piattaforme compatibili con GoogleTest.

source: See [Teaching GoogleTest How to Print Your Values](../advanced.md#teaching-googletest-how-to-print-your-values) for more information.
it_it: Vedere [Insegnare a GoogleTest Come Stampare i Valori](../advanced.md#teaching-googletest-how-to-print-your-values) per ulteriori informazioni.

source: See [Testing Private Code](../advanced.md#testing-private-code) for more information.
it_it: Vedere [Testing Private Code](../advanced.md#testing-private-code) per ulteriori informazioni.

source: See [Tip of the Week #49](https://abseil.io/tips/49) for details.
it_it: Vedere [Tip of the Week #49](https://abseil.io/tips/49) per i dettagli.

source: See [Type Assertions](../advanced.md#type-assertions) for more information.
it_it: Consultare [Type Assertions](../advanced.md#type-assertions) per ulteriori informazioni.

source: See [Typed Tests](../advanced.md#typed-tests) and [Type-Parameterized Tests](../advanced.md#type-parameterized-tests) for more information.
it_it: Consultare [Typed Tests](../advanced.md#typed-tests) e [Type-Parameterized Tests](../advanced.md#type-parameterized-tests) per ulteriori informazioni.

source: See [Typed Tests](../advanced.md#typed-tests) and [Type-Parameterized Tests](../advanced.md#type-parameterized-tests).
it_it: Consultare [Typed Tests](../advanced.md#typed-tests) e [Type-Parameterized Tests](../advanced.md#type-parameterized-tests).

source: See [Understanding Uninteresting vs Unexpected Calls](#uninteresting-vs-unexpected).
it_it: Consultare [Le Chiamate Poco Interessanti e Quelle Unexpected](#uninteresting-vs-unexpected).

source: See [Understanding Uninteresting vs Unexpected Calls](gmock_cook_book.md#uninteresting-vs-unexpected).
it_it: Consultare [Le Chiamate Poco Interessanti e Quelle Unexpected](gmock_cook_book.md#uninteresting-vs-unexpected).

source: See [Using Mocks in Tests](gmock_for_dummies.md#using-mocks-in-tests) for more information.
it_it: Vedere [Uso dei Mock nei Test](gmock_for_dummies.md#using-mocks-in-tests) per ulteriori informazioni.

source: See [Value-Parameterized Tests](../advanced.md#value-parameterized-tests).
it_it: Per ulteriori informazioni, consultare [Test con Valori Parametrizzati](../advanced.md#value-parameterized-tests).

source: See [Windows HRESULT Assertions](reference/assertions.md#HRESULT) in the Assertions Reference.
it_it: Vedere [Windows HRESULT Assertions](reference/assertions.md#HRESULT) nelle "Asserzioni di Eccezioni".

source: See [`AssertionResult`](#AssertionResult).
it_it: Vedere [`AssertionResult`](#AssertionResult).

source: See [`EXPECT_CALL`](reference/mocking.md#EXPECT_CALL) in the Mocking Reference.
it_it: Vedere [`EXPECT_CALL`](reference/mocking.md#EXPECT_CALL) nella "Guida al Mocking".

source: See [`EXPECT_PRED*`](reference/assertions.md#EXPECT_PRED) in the Assertions Reference for details.
it_it: Vedere [`EXPECT_PRED*`](reference/assertions.md#EXPECT_PRED) nei "Riferimenti sulle Asserzioni" per i dettagli.

source: See [`EXPECT_PRED_FORMAT*`](reference/assertions.md#EXPECT_PRED_FORMAT) in the Assertions Reference for details.
it_it: Vedere [`EXPECT_PRED_FORMAT*`](reference/assertions.md#EXPECT_PRED_FORMAT) nei "Riferimenti sulle Asserzioni" per i dettagli.

source: See [`EXPECT_THAT`](reference/assertions.md#EXPECT_THAT) in the Assertions Reference.
it_it: Vedere [`EXPECT_THAT`](reference/assertions.md#EXPECT_THAT) nelle "Asserzioni di Eccezioni".

source: See [`TYPED_TEST_SUITE`](#TYPED_TEST_SUITE) for an example.
it_it: Vedere [`TYPED_TEST_SUITE`](#TYPED_TEST_SUITE) per un esempio.

source: See [`TYPED_TEST`](#TYPED_TEST) for an example.
it_it: Vedere [`TYPED_TEST`](#TYPED_TEST) per un esempio.

source: See [`TestEventListeners`](#TestEventListeners).
it_it: Vedere [`TestEventListeners`](#TestEventListeners).

source: See [`TestResult`](#TestResult).
it_it: Vedere [`TestResult`](#TestResult).

source: See [`Times`](#EXPECT_CALL.Times).
it_it: Vedere [`Times`](#EXPECT_CALL.Times).

source: See [sample10_unittest.cc] for an example of a failure-raising listener.
it_it: Vedere [sample10_unittest.cc] per un esempio di un listener che genera errori.

source: See [this section](#PureMatchers) for more details.
it_it: Consultare [questa sezione](#PureMatchers) per ulteriori dettagli.

source: See [this table](https://github.com/google/oss-policies-info/blob/main/foundational-cxx-support-matrix.md) for a list of currently supported versions compilers, platforms, and build tools.
it_it: Consultare [questa tabella](https://github.com/google/oss-policies-info/blob/main/foundational-cxx-support-matrix.md) per un elenco delle versioni di compilatori, di piattaforme e di strumenti di building attualmente supportati.

source: See `gmock-actions.h` for examples.
it_it: Per gli esempi consultare `gmock-actions.h`.

source: See also GTEST_ALLOW_UNINSTANTIATED_PARAMETERIZED_TEST.
it_it: Vedere anche GTEST_ALLOW_UNINSTANTIATED_PARAMETERIZED_TEST.

source: See also Environment.
it_it: Consultare anche Environment.

source: See also INSTANTIATE_TEST_SUITE_P.
it_it: Vedere anche INSTANTIATE_TEST_SUITE_P.

source: See also INSTANTIATE_TYPED_TEST_SUITE_P and Type-Parameterized Tests for more information.
it_it: Consultare anche INSTANTIATE_TYPED_TEST_SUITE_P e Test con i Tipi Parametrizzati per ulteriori informazioni.

source: See also REGISTER_TYPED_TEST_SUITE_P and Type-Parameterized Tests for more information.
it_it: Consultare anche REGISTER_TYPED_TEST_SUITE_P e Test con i Tipi Parametrizzati per ulteriori informazioni.

source: See also SCOPED_TRACE.
it_it: Vedere anche SCOPED_TRACE.

source: See also TYPED_TEST and Typed Tests for more information.
it_it: Vedere anche TYPED_TEST e Test Tipizzati per ulteriori informazioni.

source: See also TYPED_TEST_P and Type-Parameterized Tests for more information.
it_it: Vedere anche TYPED_TEST_P e Test con i Tipi Parametrizzati per ulteriori informazioni.

source: See also TestParamInfo and INSTANTIATE_TEST_SUITE_P.
it_it: Vedere anche TestParamInfo e INSTANTIATE_TEST_SUITE_P.

source: See also [`Environment`](#Environment).
it_it: Consultare anche [`Environment`](#Environment).
